# Практическая работа по уроку "Динамическая типизация"
# Цель: Написать программу на языке Python, используя Pycharm, для демонстрации динамической типизации.
name = 'Антон'
print('Name:',name)
age = 59
print('Age:',age)
age = age + 1
print('New Age:',age)
is_student = True
print('Is Student:',is_student)
