# Организация программ и методы строк
'''Цель: Написать программу на языке Python с использованием Pycharm
для работы с методами строк и организации программ.'''
my_string = input()
print(len(my_string))# Выводим количество символов введённого текста
print(my_string.upper())# Выводим строку my_string в верхнем регистре.
print(my_string.lower())# Выводим строку my_string в нижнем регистре.
print(my_string.replace(' ',''))# Изменяем строку my_string, удалив все пробелы.
print(my_string[0])# Выводим первый символ строки my_string.
print(my_string[-1])# Выводим последний символ строки my_string.
